AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КвизРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КвизРезультаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Команды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Города</xr:Item>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аббревиатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/Квиз/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ДатаНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ТикТак() Экспорт
	Таймер = Финиш - ДатаНаСервере();
	Если Финиш <= ДатаНаСервере() Тогда
		Стоп(3);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Дальше() Экспорт
	Было.Добавить(ТекущийВопрос);
	
	ОсталосьВопросов	= ОсталосьВопросов - 1;
	
	Если ОсталосьВопросов = 0 Тогда
		Стоп();
	ИначеЕсли ВопросУстановить() Тогда
		Вопрос	= "";
		Таймер 	= Финиш - ДатаНаСервере();
		ОтветыОбновить();
	Иначе
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолноеНаименование(Ссылка)
	Возврат Ссылка.ПолноеНаименование();
КонецФункции

&НаСервере
Функция ВопросУстановитьНаСервере()
	ЭтоФиниш = Истина;
	Для Каждого Элемент Из Вопросы Цикл
		Если ПустаяСтрока(Элемент.Представление) Тогда
			ТекущийВопрос	= Элемент.Значение;
			ВопросТекст		= ПолноеНаименование(ТекущийВопрос);
			ЭтоФиниш = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЭтоФиниш;
КонецФункции

&НаКлиенте
Функция ВопросУстановить()
	Если ВопросУстановитьНаСервере() Тогда
		ТекущийВопрос	= Неопределено;
		ВопросТекст		= "";
	Иначе
		ХроносДобавить();
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ТекущийВопрос);
КонецФункции

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка, Кеш)
	Элемент	= Кеш.НайтиПоЗначению(Ссылка);
	Если Элемент = Неопределено Тогда
		Изо = СерверныйФункции.ИзображениеПолучить(Ссылка);
		Кеш.Добавить(Ссылка, Изо);
	Иначе
		Изо = Элемент.Представление;
	КонецЕсли;
	Возврат Изо;
КонецФункции

&НаСервере
Процедура ОтветыОбновить(Обновить=Ложь)
	ГС		= Новый ГенераторСлучайныхЧисел;

	Элементы.Вопрос.Видимость	= Ложь;
	
	Вопросник	= ГС.СлучайноеЧисло(0, ОтветыТекущие.Количество() - 1);
	Пронто		= Новый Массив;
	Для Каждого Ответ Из ОтветыТекущие Цикл
		Если Вопросник = Ответ.ПолучитьИдентификатор() Тогда
			Изо	= ИзображениеПолучить(ТекущийВопрос, Кеш);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Ответ.Значение, Изо));
			Элемент = Вопросы.НайтиПоЗначению(ТекущийВопрос);
			Элемент.Представление	= Изо;
		Иначе
			Виктим		= Неопределено;
			Ответы.СортироватьПоПредставлению();
			Итератор	= Вопросы.Количество();
			Пока Виктим = Неопределено Цикл
				Для Каждого Элемент Из Ответы Цикл
					Если Пронто.Найти(Элемент.Значение) <> Неопределено Тогда
						//
					ИначеЕсли Элемент.Значение = ТекущийВопрос Тогда
						//
					ИначеЕсли Итератор <= Вопросник Тогда
						Виктим	= Элемент;
						Прервать;
					КонецЕсли;
					Итератор = Итератор - ?(Ответ.Пометка, 3.1, 1.7) * Макс(1, Секунда(ТекущаяДатаСеанса()));
				КонецЦикла;
			КонецЦикла;
			Изо	= ИзображениеПолучить(Виктим.Значение, Кеш);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Ответ.Значение, Изо));
			Виктим.Представление	= Изо;
			
			Пронто.Добавить(Виктим.Значение);
		КонецЕсли;
		Ответ.Представление		= Изо;
	КонецЦикла;
	Элементы.ГруппаОтветы.Доступность = Истина;
	
	Если Обновить Тогда
		ВидимостьУстановить(Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить(ЭтоСтарт=Ложь)
	Элементы.СтраницаНачало.Видимость	= (Шаг < 1);
	Элементы.СтраницаТест.Видимость		= (Шаг = 1);
	Элементы.СтраницаФиниш.Видимость	= (Шаг > 1);
	Если ЭтоСтарт Тогда
		Элементы.ГруппаПараметры.ТолькоПросмотр = Истина;
		ДатаНачало	= ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Стоп(ШагСледующий=2)
	ОтключитьОбработчикОжидания("ТикТак");
	
	Если ШагСледующий = 2 Тогда
		Затрачено			= ДатаНаСервере() - ДатаНачало;
		ЗатраченоВремени	= РазницаВоВремени(Затрачено);
	ИначеЕсли ШагСледующий = 3 Тогда
		ХроносДобавить("");
		Затрачено			= -1;
		ЗатраченоВремени	= "Время истекло";
	Иначе
		ХроносДобавить("");
		Затрачено			= -1;
		ЗатраченоВремени	= "Прервано";
	КонецЕсли;
	Шаг		= ШагСледующий;
	СтопНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветНажатие(Элемент, СтандартнаяОбработка)
	Элементы.ГруппаОтветы.Доступность	= Ложь;
	СтандартнаяОбработка				= Ложь;
	
	Если Шаг = 1 Тогда
		Вопрос		= Вопросы.НайтиПоЗначению(ТекущийВопрос).Представление;
		Элементы.Вопрос.Видимость	= Истина;
		Если СтрСравнить(Вычислить(Элемент.Имя), Вопрос) = 0 Тогда
			ПравильныхОтветов	= ПравильныхОтветов + 1;
			Исключения.Добавить(ТекущийВопрос);
			
			ХроносДобавить(ТекущийВопрос);
		Иначе
			ХроносДобавить("");
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Дальше", 0.1, Истина);
	Иначе
		ВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РазницаВоВремени(Знач Количество, Знач Степ=2)
	Степ = Степ - 1;
	Ответ = "";
	Если Количество = 0 Или Степ < 0 Тогда
	ИначеЕсли Количество < 60 Тогда
		Ответ = Строка(Количество) + " сек";
	ИначеЕсли Количество < 3600 Тогда
		Ответ = Строка(Цел(Количество/60)) + " мин " + РазницаВоВремени(Количество-Цел(Количество/60)*60, Степ);
	Иначе
		Ответ = Строка(Цел(Количество/3600)) + " час " + РазницаВоВремени(Количество-Цел(Количество/3600)*3600, Степ);
	КонецЕсли;
	Возврат СокрП(Ответ);
КонецФункции

&НаСервереБезКонтекста
Функция Цвет(Аларм=Ложь)
	Возврат ?(Аларм, ЦветаСтиля.ЦветОтрицательногоЧисла, ЦветаСтиля.ЦветТекстаФормы);
КонецФункции

&НаСервере
Процедура СтопНаСервере()
	Элементы.ПравильныхОтветов.ЦветТекста	= Цвет();
	Элементы.ЗатраченоВремени.ЦветТекста	= Цвет();
	Если ПравильныхОтветов = КоличествоВопросов Тогда
		Элементы.ПравильныхОтветов.ЦветТекста = Цвет(Истина);
		Если Затрачено <= Макс(30, 2.8 * КоличествоВопросов - Уровень) Тогда
			Элементы.ЗатраченоВремени.ЦветТекста = Цвет(Истина);
			Для Каждого Элемент Из Ответы Цикл
				Если Исключения.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
					Исключения.Добавить(Элемент.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ПравильныхОтветов = 0 Тогда
		Элементы.ПравильныхОтветов.ЦветТекста = Цвет(Истина);
	КонецЕсли;
	ВидимостьУстановить();
	
	ХроносЗаписать();
КонецПроцедуры

&НаСервере
Функция ЗапросИнит(ЧислоСлевина=0)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 66
	                      |	ТурнирнаяТаблица.Команда КАК Ссылка,
	                      |	Итоги.Команда В (&Было) КАК Пометка,
	                      |	ЛОЖЬ КАК МояКоманда
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Итоги КАК Итоги
	                      |		ПО ТурнирнаяТаблица.Команда = Итоги.Команда
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Период >= &Дата
	                      |	И ТурнирнаяТаблица.Тур.Владелец.Владелец В
	                      |			(ВЫБРАТЬ
	                      |				Лиги.Лига
	                      |			ИЗ
	                      |				(ВЫБРАТЬ ПЕРВЫЕ 5
	                      |					ТурнирнаяТаблица.Тур.Владелец.Владелец КАК Лига,
	                      |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
	                      |				ИЗ
	                      |					РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |				СГРУППИРОВАТЬ ПО
	                      |					ТурнирнаяТаблица.Тур.Владелец.Владелец
	                      |				УПОРЯДОЧИТЬ ПО
	                      |					Количество УБЫВ) КАК Лиги)
	                      |	И РАЗМЕРХРАНИМЫХДАННЫХ(ТурнирнаяТаблица.Команда.Изображение) >= 64
	                      |	И ЕСТЬNULL(Итоги.Период, ТурнирнаяТаблица.Период) >= &Дата
	                      |	И ЕСТЬNULL(Итоги.Место, 99) <= 6
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда,
	                      |	Итоги.Команда В (&Было)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Пометка,
	                      |	ЕСТЬNULL(МАКСИМУМ(Итоги.Место), 99) <= &ЧислоСлевина,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) УБЫВ");
	Если ЗначениеЗаполнено(МояКоманда) И ЧислоСлевина <= 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 66
		               |	ТурнирнаяТаблица.Команда КАК Ссылка,
		               |	ТурнирнаяТаблица.Команда В (&Было) КАК Пометка,
		               |	ЛОЖЬ КАК МояКоманда
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Моя
		               |		ПО ТурнирнаяТаблица.Регистратор = Моя.Регистратор
		               |ГДЕ
		               |	ТурнирнаяТаблица.Период >= &Дата
		               |	И ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ИСТИНА
		               |				ТОГДА ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна ЕСТЬ NULL
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И РАЗМЕРХРАНИМЫХДАННЫХ(ТурнирнаяТаблица.Команда.Изображение) >= 64
		               |	И Моя.Команда = &Команда
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Пометка,
		               |	МАКСИМУМ(ТурнирнаяТаблица.КоличествоОчков = &ЧислоСлевина) УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",				ДобавитьМесяц(ТекущаяДатаСеанса(), -42));
	Запрос.УстановитьПараметр("ДатаН",				НачалоМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаК",				НачалоЧаса(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Команда",			МояКоманда);
	Запрос.УстановитьПараметр("Было",				Было);
	Запрос.УстановитьПараметр("Исключения",			Исключения);
	Запрос.УстановитьПараметр("ЧислоСлевина",		0);
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ВопросыОтветыПолучить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Запрос = ЗапросИнит(ГС.СлучайноеЧисло(0, 3));
	Запрос.УстановитьПараметр("ЧислоСлевина",		ГС.СлучайноеЧисло(0, 3));
	Если Уровень = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 199
		               |	Команды.Ссылка КАК Ссылка,
		               |	Команды.Ссылка В (&Было) КАК Пометка,
		               |	Команды.Ссылка = &Команда КАК МояКоманда
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 199
		               |			КвизРезультаты.Вопрос КАК Команда,
		               |			СРЕДНЕЕ(ОКР(ВЫБОР
		               |						КОГДА КвизРезультаты.Время >= 0
		               |							ТОГДА КвизРезультаты.Время * 0.001
		               |						ИНАЧЕ 1000 / КвизРезультаты.Время
		               |					КОНЕЦ)) КАК Количество
		               |		ИЗ
		               |			РегистрСведений.КвизРезультаты КАК КвизРезультаты
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |				ПО КвизРезультаты.Вопрос = ТурнирнаяТаблица.Команда
		               |		ГДЕ
		               |			КвизРезультаты.Период МЕЖДУ &ДатаН И &ДатаК
		               |			И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		               |			И (КвизРезультаты.Вопрос В (&Исключения)) = ЛОЖЬ
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			КвизРезультаты.Вопрос
		               |		
		               |		УПОРЯДОЧИТЬ ПО
		               |			Количество УБЫВ) КАК КвизРезультаты
		               |		ПО Команды.Ссылка = КвизРезультаты.Команда
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ
		               |	И РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) >= 64
		               |	И (Команды.Ссылка В (&Исключения)) = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Пометка,
		               |	ОКР(ЕСТЬNULL(КвизРезультаты.Количество, 9999)) УБЫВ";
	ИначеЕсли Уровень = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 199
		               |	Команды.Ссылка КАК Ссылка,
		               |	Команды.Ссылка В (&Было) КАК Пометка,
		               |	Команды.Ссылка = &Команда КАК МояКоманда
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 199
		               |			КвизРезультаты.Вопрос КАК Команда,
		               |			ЕСТЬNULL(МИНИМУМ(Итоги.Место), 99) <= 11 КАК Порядок,
		               |			СРЕДНЕЕ(КвизРезультаты.Время) КАК Количество
		               |		ИЗ
		               |			РегистрСведений.КвизРезультаты КАК КвизРезультаты
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Итоги КАК Итоги
		               |				ПО КвизРезультаты.Вопрос = Итоги.Команда
		               |		ГДЕ
		               |			КвизРезультаты.Период МЕЖДУ &ДатаН И &ДатаК
		               |			И КвизРезультаты.Время >= 0
		               |			И (КвизРезультаты.Вопрос В (&Исключения)) = ЛОЖЬ
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			КвизРезультаты.Вопрос
		               |		
		               |		УПОРЯДОЧИТЬ ПО
		               |			Порядок УБЫВ,
		               |			Количество УБЫВ) КАК КвизРезультаты
		               |		ПО Команды.Ссылка = КвизРезультаты.Команда
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ
		               |	И РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) >= 64
		               |	И (Команды.Ссылка В (&Исключения)) = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Пометка,
		               |	ОКР(ЕСТЬNULL(КвизРезультаты.Количество, 9999)) УБЫВ";
	КонецЕсли;
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= КоличествоВопросов * 2 Тогда
		ОчиститьКеш();
		Выборка	= Запрос.Выполнить().Выбрать();
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если Ответы.Количество() = 0 И Выборка.Пометка Тогда
			Было.Очистить();
		ИначеЕсли Уровень > 0 И Выборка.Количество() > 3 * КоличествоВопросов И ГС.СлучайноеЧисло(0, 3) = 0 Тогда
			Продолжить;
		ИначеЕсли Вопросы.Количество() < КоличествоВопросов И НЕ Выборка.МояКоманда Тогда
			Вопросы.Добавить(Выборка.Ссылка);
			Если Уровень > 0 И ГС.СлучайноеЧисло(0, 3) = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Ответы.Добавить(Выборка.Ссылка,, Выборка.Пометка);
	КонецЦикла;
	Возврат (Ответы.Количество() > КоличествоВопросов);
КонецФункции

&НаСервере
Процедура ОчиститьКеш()
	Было.Очистить();
	Исключения.Очистить();
	Если Уровень = 2 Тогда
		Запрос = ЗапросИнит();
		Исключения.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ХроносДобавить(Ответ=Неопределено)
	Если Ответ = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Хронос.Добавить(), Новый Структура("Дата,Время,Вопрос,ЭтоВопрос", ДатаНаСервере(), ТекущаяУниверсальнаяДатаВМиллисекундах(), ТекущийВопрос, Истина));
	Иначе
		ЗаполнитьЗначенияСвойств(Хронос.Добавить(), Новый Структура("Дата,Время,Вопрос,Ответ", ДатаНаСервере(), ТекущаяУниверсальнаяДатаВМиллисекундах(), ТекущийВопрос, Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ХроносЗаписать()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ.Дата КАК Дата,
	                      |	ВТ.Время КАК Время,
	                      |	ВТ.Вопрос КАК Вопрос,
	                      |	ВТ.Ответ КАК Ответ,
	                      |	ВТ.ЭтоВопрос КАК ЭтоВопрос
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ВТ КАК ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Дата КАК Период,
	                      |	ВТ.Вопрос КАК Вопрос,
	                      |	ВЫБОР
	                      |		КОГДА ВТ1.Время ЕСТЬ NULL
	                      |			ТОГДА 1
	                      |		КОГДА ВТ.Вопрос = ВТ1.Ответ
	                      |			ТОГДА ВТ.Время - ВТ1.Время
	                      |		ИНАЧЕ ВТ1.Время - ВТ.Время
	                      |	КОНЕЦ КАК Время
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ВТ1.Вопрос КАК Вопрос,
	                      |			ВТ1.Ответ КАК Ответ,
	                      |			МИНИМУМ(ВТ1.Время) КАК Время
	                      |		ИЗ
	                      |			ВТ КАК ВТ1
	                      |		ГДЕ
	                      |			ВТ1.ЭтоВопрос = ЛОЖЬ
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВТ1.Вопрос,
	                      |			ВТ1.Ответ) КАК ВТ1
	                      |		ПО ВТ.Вопрос = ВТ1.Вопрос
	                      |			И ВТ.Время < ВТ1.Время
	                      |ГДЕ
	                      |	ВТ.ЭтоВопрос = ИСТИНА");
	Запрос.УстановитьПараметр("ВТ",		Хронос.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Выборка.Период);
		НЗ.Отбор.Вопрос.Установить(Выборка.Вопрос);
		ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Выборка);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Старт()
	Вопросы.Очистить();
	Ответы.Очистить();
	Заголовок = Лев(Заголовок + "!", 42);
	Если ВопросыОтветыПолучить() Тогда
		Шаг	= 1;
		Если ВопросУстановить() Тогда
			ПравильныхОтветов	= 0;
			КоличествоВопросов	= Вопросы.Количество();
			ОсталосьВопросов	= КоличествоВопросов;
			Элементы.ОсталосьВопросов.МаксимальноеЗначение	= КоличествоВопросов;
			Таймер				= Макс(60, КоличествоВопросов * (5.1 - Уровень));
			Элементы.Таймер.МаксимальноеЗначение			= Таймер;
			Финиш				= ДатаНаСервере() + Таймер;
			
			ОтветыОбновить(Истина);
			
			ПодключитьОбработчикОжидания("ТикТак", 5);
		Иначе
			Шаг = 9;
			ВидимостьУстановить();
		КонецЕсли;
		
	ИначеЕсли Исключения.Количество() > 0 Тогда
		ОчиститьКеш();
		
		Старт();
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании вопросов");
		Элементы.СтраницаНачало.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтарт(Команда)
	Старт();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Шаг = 0 Тогда
		//
	ИначеЕсли Шаг = 1 И ОсталосьВопросов = КоличествоВопросов Тогда
		ХроносДобавить("");
		ХроносЗаписать();
	ИначеЕсли Шаг = 1 Тогда
		Отказ	= Истина;
		Стоп(4);
	ИначеЕсли Шаг <= 3 Тогда
		Отказ	= Истина;
		Шаг		= 0;
		Элементы.КомандаСтарт.Заголовок = "Повторить";
		ВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МояКоманда			= НаСервереПовторно.МояКомандаПолучить();
	КоличествоВопросов	= Макс(10, КоличествоВопросов);
	Если Уровень = 2 И ЗначениеЗаполнено(МояКоманда) И Исключения.НайтиПоЗначению(МояКоманда) = Неопределено Тогда
		Исключения.Добавить(МояКоманда);
	КонецЕсли;
	
	ОтветыТекущие.Добавить("Ответ0");
	ОтветыТекущие.Добавить("Ответ1");
	ОтветыТекущие.Добавить("Ответ2");
	ОтветыТекущие.Добавить("Ответ3");
	ОтветыТекущие.Добавить("Ответ4");
	ОтветыТекущие.Добавить("Ответ5");
КонецПроцедуры
